RIET/src/Documents/ОтражениеАвансовогоОтчета/ОтражениеАвансовогоОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтражениеАвансовогоОтчета</name>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <tabularSections>
    <name>Проводки</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяЗатрат</name>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </attributes>
    <attributes>
      <name>СчетУчета</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RIET/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <comment>(Регл)</comment>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЖурнала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

RIET/src/ChartsOfCharacteristicTypes/ВидыСубконтоХозрасчетные/ВидыСубконтоХозрасчетные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконтоХозрасчетные</name>
  <comment>(Регл)</comment>
  <type>
    <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
    <types>CatalogRef.Склады</types>
    <types>DocumentRef.ПередачаОС</types>
    <types>DocumentRef.АвансовыйОтчет</types>
    <types>CatalogRef.ОсновныеСредства</types>
    <types>DocumentRef.СчетФактураВыданный</types>
    <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
    <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
    <types>DocumentRef.ПринятиеКУчетуОС</types>
    <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
    <types>CatalogRef.ДоговорыКонтрагентов</types>
    <types>DocumentRef.РасходныйКассовыйОрдер</types>
    <types>EnumRef.ВидыПлатежейВГосБюджет</types>
    <types>CatalogRef.НомераГТД</types>
    <types>EnumRef.ДвиженияЦелевыхСредств</types>
    <types>CatalogRef.КлассификаторСтранМира</types>
    <types>CatalogRef.ПрочиеДоходыИРасходы</types>
    <types>EnumRef.ВидыСтоимости</types>
    <types>DocumentRef.КорректировкаДолга</types>
    <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
    <types>CatalogRef.БанковскиеСчета</types>
    <types>EnumRef.УсловияПоступленияИВыбытияИмущества</types>
    <types>CatalogRef.ПодразделенияОрганизаций</types>
    <types>DocumentRef.СчетФактураПолученный</types>
    <types>CatalogRef.НоменклатурныеГруппы</types>
    <types>EnumRef.УровниБюджетов</types>
    <types>CatalogRef.ОбъектыСтроительства</types>
    <types>DocumentRef.ПриходныйКассовыйОрдер</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.РасходыБудущихПериодов</types>
    <types>DocumentRef.РеализацияТоваровУслуг</types>
    <types>EnumRef.ВидыНачисленийОплатыТрудаПоСт255НК</types>
    <types>DocumentRef.ОтражениеНачисленияНДС</types>
    <types>EnumRef.СпособыСтроительства</types>
    <types>CatalogRef.СтатьиЗатрат</types>
    <types>CatalogRef.Организации</types>
    <types>EnumRef.СтавкиНДС</types>
    <types>EnumRef.ВидыЦенностей</types>
    <types>CatalogRef.Номенклатура</types>
    <types>EnumRef.ПрибылиИУбытки</types>
    <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    <types>EnumRef.ВидыАктивовИОбязательств</types>
    <types>CatalogRef.ФизическиеЛица</types>
  </type>
  <predefined>
    <items>
      <name>БанковскиеСчета</name>
      <description>Банковские счета</description>
      <code>00008</code>
      <type>
        <types>CatalogRef.БанковскиеСчета</types>
      </type>
    </items>
    <items>
      <name>ВидНачисленийОплатыТрудаПоСтатье255НК</name>
      <description>Вид начислений оплаты труда</description>
      <code>00031</code>
      <type>
        <types>EnumRef.ВидыНачисленийОплатыТрудаПоСт255НК</types>
      </type>
    </items>
    <items>
      <name>ВидыАктивовИОбязательств</name>
      <description>Виды активов и обязательств</description>
      <code>00023</code>
      <type>
        <types>EnumRef.ВидыАктивовИОбязательств</types>
      </type>
    </items>
    <items>
      <name>ВидыПлатежейВГосБюджет</name>
      <description>Виды платежей в бюджет (фонды)</description>
      <code>00022</code>
      <type>
        <types>EnumRef.ВидыПлатежейВГосБюджет</types>
      </type>
    </items>
    <items>
      <name>ВидыСтоимости</name>
      <description>Виды стоимости</description>
      <code>00049</code>
      <type>
        <types>EnumRef.ВидыСтоимости</types>
      </type>
    </items>
    <items>
      <name>ВидыЦенностей</name>
      <description>Виды ценностей</description>
      <code>00043</code>
      <type>
        <types>EnumRef.ВидыЦенностей</types>
      </type>
    </items>
    <items>
      <name>ДвиженияЦелевыхСредств</name>
      <description>Движения целевых средств</description>
      <code>00030</code>
      <type>
        <types>EnumRef.ДвиженияЦелевыхСредств</types>
      </type>
    </items>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>00016</code>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </items>
    <items>
      <name>ДокументыРасчетовСКонтрагентами</name>
      <description>Документы расчетов с контрагентом</description>
      <code>00039</code>
      <type>
        <types>DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</types>
        <types>DocumentRef.ПередачаОС</types>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПлатежноеПоручениеИсходящее</types>
        <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
        <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтражениеНачисленияНДС</types>
      </type>
    </items>
    <items>
      <name>ДокументыРеализации</name>
      <description>Документы реализации</description>
      <code>00046</code>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтражениеНачисленияНДС</types>
      </type>
    </items>
    <items>
      <name>Комиссионеры</name>
      <description>Комиссионеры</description>
      <code>00037</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>00005</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>00001</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>НоменклатурныеГруппы</name>
      <description>Номенклатурные группы</description>
      <code>00012</code>
      <type>
        <types>CatalogRef.НоменклатурныеГруппы</types>
      </type>
    </items>
    <items>
      <name>НомераГТД</name>
      <description>Номера ГТД</description>
      <code>00050</code>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </items>
    <items>
      <name>ОбособленныеПодразделения</name>
      <description>Обособленные подразделения</description>
      <code>00036</code>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </items>
    <items>
      <name>ОбъектыСтроительства</name>
      <description>Объекты строительства</description>
      <code>00011</code>
      <type>
        <types>CatalogRef.ОбъектыСтроительства</types>
      </type>
    </items>
    <items>
      <name>ОсновныеСредства</name>
      <description>Основные средства</description>
      <code>00004</code>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </items>
    <items>
      <name>Партии</name>
      <description>Партии</description>
      <code>00038</code>
      <type>
        <types>DocumentRef.АвансовыйОтчет</types>
        <types>DocumentRef.ПринятиеКУчетуОС</types>
      </type>
    </items>
    <items>
      <name>Подразделения</name>
      <description>Подразделения</description>
      <code>00015</code>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </items>
    <items>
      <name>ПрибылиИУбытки</name>
      <description>Прибыли и убытки</description>
      <code>00014</code>
      <type>
        <types>EnumRef.ПрибылиИУбытки</types>
      </type>
    </items>
    <items>
      <name>Продавцы</name>
      <description>Продавцы</description>
      <code>00040</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>ПрочиеДоходыИРасходы</name>
      <description>Прочие доходы и расходы</description>
      <code>00013</code>
      <type>
        <types>CatalogRef.ПрочиеДоходыИРасходы</types>
      </type>
    </items>
    <items>
      <name>РаботникиОрганизаций</name>
      <description>Работники организаций</description>
      <code>00003</code>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
    <items>
      <name>РасходыБудущихПериодов</name>
      <description>Расходы будущих периодов</description>
      <code>00017</code>
      <type>
        <types>CatalogRef.РасходыБудущихПериодов</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>00027</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>СпособыСтроительства</name>
      <description>Способы строительства</description>
      <code>00034</code>
      <type>
        <types>EnumRef.СпособыСтроительства</types>
      </type>
    </items>
    <items>
      <name>СтавкиНДС</name>
      <description>Ставки НДС</description>
      <code>00026</code>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </items>
    <items>
      <name>СтатьиДвиженияДенежныхСредств</name>
      <description>Статьи движения денежных средств</description>
      <code>00021</code>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </items>
    <items>
      <name>СтатьиЗатрат</name>
      <description>Статьи затрат</description>
      <code>00007</code>
      <type>
        <types>CatalogRef.СтатьиЗатрат</types>
      </type>
    </items>
    <items>
      <name>СтраныПроисхождения</name>
      <description>Страны происхождения</description>
      <code>00051</code>
      <type>
        <types>CatalogRef.КлассификаторСтранМира</types>
      </type>
    </items>
    <items>
      <name>СФВыданные</name>
      <description>Счета-фактуры выданные</description>
      <code>00052</code>
      <type>
        <types>DocumentRef.ПередачаОС</types>
        <types>DocumentRef.СчетФактураВыданный</types>
        <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
        <types>DocumentRef.ПринятиеКУчетуОС</types>
        <types>DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.ПлатежноеПоручениеВходящее</types>
        <types>DocumentRef.ПриходныйКассовыйОрдер</types>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
        <types>DocumentRef.ОтражениеНачисленияНДС</types>
      </type>
    </items>
    <items>
      <name>СФПолученные</name>
      <description>Счета-фактуры полученные</description>
      <code>00042</code>
      <type>
        <types>DocumentRef.ДокументРасчетовСКонтрагентом</types>
        <types>DocumentRef.ПринятиеКУчетуОС</types>
        <types>DocumentRef.СчетФактураПолученный</types>
      </type>
    </items>
    <items>
      <name>УровниБюджетов</name>
      <description>Уровни бюджетов</description>
      <code>00025</code>
      <type>
        <types>EnumRef.УровниБюджетов</types>
      </type>
    </items>
    <items>
      <name>УсловияПоступленияИВыбытия</name>
      <description>Условия поступления и выбытия</description>
      <code>00020</code>
      <type>
        <types>EnumRef.УсловияПоступленияИВыбытияИмущества</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

RIET/src/Documents/ОтражениеАвансовогоОтчета/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// This fragment was built by the wizard.
	// Warning! All manually made changes will be lost next time you use the wizard.
	// register Хозрасчетный 
	#Если Клиент Тогда
	Для Каждого СтрокаТЧ Из Проводки Цикл
		Движение = Движения.Хозрасчетный.Добавить();
		Движение.Организация = ОсновнаяОрганизация;
		Движение.СчетКт = ПланыСчетов.Хозрасчетный.РасчетыСПодотчетнымиЛицами;
		Движение.Период = Дата;
		Движение.СчетДт = СтрокаТЧ.СчетУчета;
		Движение.ПодразделениеОрганизацииДт = СтрокаТЧ.Подразделение;
		Движение.ПодразделениеОрганизацииКт = СтрокаТЧ.Подразделение;
		Движение.Сумма = СтрокаТЧ.Сумма;
		Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.РаботникиОрганизаций] = СтрокаТЧ.Сотрудник;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.Подразделения] = СтрокаТЧ.Подразделение;
		Движение.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные.СтатьиЗатрат] = СтрокаТЧ.СтатьяЗатрат;
	КонецЦикла;
	#КонецЕсли
	// writing register movements
	Движения.Хозрасчетный.Записать();
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
